# Is3DMImportLinkAvailable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OptionalFunctionalityUtils..::..Is3DMImportLinkAvailable Method
OptionalFunctionalityUtils Class See Also
---
Checks whether the 3DM Import/Link functionality is available in the installed Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static bool Is3DMImportLinkAvailable()
```

Visual Basic
---
```text
Public Shared Function Is3DMImportLinkAvailable As Boolean
```

Visual C++
---
```text
public:
static bool Is3DMImportLinkAvailable()
```

# ### Return Value
True if the 3DM Import/Link functionality is available in the installed Revit.
# Remarks
3DM Import/Link is optional functionality that does not have to be part of the Revit installation.
# See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace